app/controllers/instruments_controller.rb

SELECT "instruments".* FROM "instruments" ORDER BY created_at
---
  def index
    @instruments = Instrument.all.order("created_at")

INSERT INTO "instruments" ("brand", "model", "description", "condition", "finish", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @instrument = current_user.instruments.build(instrument_params)

    respond_to do |format|
      if @instrument.save

DELETE FROM "instruments" WHERE "instruments"."id" = ?  [["id", 1]]
---
  def destroy
    @instrument.destroy

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_instrument
      @instrument = Instrument.find(params[:id])